rails-marathon/app/controllers/houses_controller.rb

  def create
    @house = House.new(new_house_params)
    if @house.save
---
INSERT INTO "houses" ("name", "author", "source", "motto", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def show
    @house = House.find(params[:id])
    @members = Member.where(house: @house)
---
SELECT  "members".* FROM "members" WHERE "members"."house_id" = $1 LIMIT $2  [["house_id", 8], ["LIMIT", 1]]

  def update
    @house = House.find(params[:id])

    if @house.update(new_house_params)
---
UPDATE "houses" SET "source" = $1, "motto" = $2, "updated_at" = $3 WHERE "houses"."id" = $4  [["source", "so WOW"], ["motto", "gocoo so good"], ["updated_at", 2017-10-12 19:46:34 UTC], ["id", 3]]

  def destroy
    @house = House.find(params[:id])
    @house.destroy
---
DELETE FROM "houses" WHERE "houses"."id" = $1  [["id", 2]]